Revit 2027 API
BuiltInFailures.ConnectorFailures.FittingMustBeOnDuctWarn Property
 The [Tap] must be attached to duct.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FittingMustBeOnDuctWarn { get; }
Public Shared ReadOnly Property FittingMustBeOnDuctWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FittingMustBeOnDuctWarn {
	FailureDefinitionId^ get ();
}
static member FittingMustBeOnDuctWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace